Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20n/atdf/ATSAMC20N17A.atdf
        <module name="ADC" id="U2247" version="2.3.0">
          <instance name="ADC0">
            <register-group name="ADC0" name-in-module="ADC" address-space="base" offset="0x42004400"/>
            <signals>
              <signal group="AIN" index="0" function="B_ADC1" pad="PA02"/>
              <signal group="AIN" index="0" function="B_ADC0" pad="PA02"/>
              <signal group="AIN" index="1" function="B_ADC1" pad="PA03"/>
              <signal group="AIN" index="1" function="B_ADC0" pad="PA03"/>
              <signal group="AIN" index="2" function="B_ADC1" pad="PB08"/>
              <signal group="AIN" index="2" function="B_ADC0" pad="PB08"/>
              <signal group="AIN" index="3" function="B_ADC1" pad="PB09"/>
              <signal group="AIN" index="3" function="B_ADC0" pad="PB09"/>
              <signal group="AIN" index="4" function="B_ADC1" pad="PA04"/>
              <signal group="AIN" index="4" function="B_ADC0" pad="PA04"/>
              <signal group="AIN" index="5" function="B_ADC1" pad="PA05"/>
              <signal group="AIN" index="5" function="B_ADC0" pad="PA05"/>
              <signal group="AIN" index="6" function="B_ADC1" pad="PA06"/>
              <signal group="AIN" index="6" function="B_ADC0" pad="PA06"/>
              <signal group="AIN" index="7" function="B_ADC1" pad="PA07"/>
              <signal group="AIN" index="7" function="B_ADC0" pad="PA07"/>
              <signal group="AIN" index="8" function="B_ADC0" pad="PC00"/>
              <signal group="AIN" index="9" function="B_ADC0" pad="PC01"/>
              <signal group="AIN" index="10" function="B_ADC0" pad="PC02"/>
              <signal group="AIN" index="11" function="B_ADC0" pad="PC03"/>
              <signal group="VREFP" function="B_ANAREF" pad="PA03"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RESRDY" value="42"/>
              <param name="EXTCHANNEL_MSB" value="11"/>
              <param name="GCLK_ID" value="33"/>
              <param name="INT_CH30" value="0"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="INSTANCE_ID" value="81"/>
            </parameters>
          </instance>
        </module>
        <module name="CCL" id="U2225" version="2.0.0">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x42005C00"/>
            <signals>
              <signal group="IN" index="0" function="I" pad="PA04"/>
              <signal group="IN" index="0" function="I" pad="PA16"/>
              <signal group="IN" index="0" function="I" pad="PB22"/>
              <signal group="IN" index="1" function="I" pad="PA05"/>
              <signal group="IN" index="1" function="I" pad="PA17"/>
              <signal group="IN" index="1" function="I" pad="PB00"/>
              <signal group="IN" index="2" function="I" pad="PA06"/>
              <signal group="IN" index="2" function="I" pad="PA18"/>
              <signal group="IN" index="2" function="I" pad="PB01"/>
              <signal group="IN" index="3" function="I" pad="PA08"/>
              <signal group="IN" index="3" function="I" pad="PA30"/>
              <signal group="IN" index="4" function="I" pad="PA09"/>
              <signal group="IN" index="4" function="I" pad="PC27"/>
              <signal group="IN" index="5" function="I" pad="PA10"/>
              <signal group="IN" index="5" function="I" pad="PB10"/>
              <signal group="IN" index="5" function="I" pad="PC28"/>
              <signal group="IN" index="6" function="I" pad="PA22"/>
              <signal group="IN" index="6" function="I" pad="PB06"/>
              <signal group="IN" index="7" function="I" pad="PB07"/>
              <signal group="IN" index="7" function="I" pad="PA23"/>
              <signal group="IN" index="8" function="I" pad="PB08"/>
              <signal group="IN" index="8" function="I" pad="PA24"/>
              <signal group="IN" index="9" function="I" pad="PB14"/>
              <signal group="IN" index="9" function="I" pad="PC20"/>
              <signal group="IN" index="10" function="I" pad="PB15"/>
              <signal group="IN" index="10" function="I" pad="PC21"/>
              <signal group="IN" index="11" function="I" pad="PB16"/>
              <signal group="OUT" index="0" function="I" pad="PA07"/>
              <signal group="OUT" index="0" function="I" pad="PA19"/>
              <signal group="OUT" index="0" function="I" pad="PB02"/>
              <signal group="OUT" index="0" function="I" pad="PB23"/>
              <signal group="OUT" index="1" function="I" pad="PA11"/>
              <signal group="OUT" index="1" function="I" pad="PA31"/>
              <signal group="OUT" index="1" function="I" pad="PB11"/>
              <signal group="OUT" index="2" function="I" pad="PA25"/>
              <signal group="OUT" index="2" function="I" pad="PB09"/>
              <signal group="OUT" index="3" function="I" pad="PB17"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="38"/>
              <param name="LUT_NUM" value="4"/>
              <param name="SEQ_NUM" value="2"/>
              <param name="INSTANCE_ID" value="87"/>
            </parameters>
          </instance>
        </module>
        <module name="DIVAS" id="U2258" version="1.0.0">
          <instance name="DIVAS">
            <register-group name="DIVAS" name-in-module="DIVAS" address-space="base" offset="0x48000000"/>
          </instance>
        </module>
        <module name="DMAC" id="U2223" version="2.3.0">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="CH_BITS" value="4"/>
              <param name="CH_NUM" value="12"/>
              <param name="EVIN_NUM" value="4"/>
              <param name="EVOUT_NUM" value="4"/>
              <param name="LVL_BITS" value="2"/>
              <param name="LVL_NUM" value="4"/>
              <param name="QOSCTRL_D_RESETVALUE" value="2"/>
              <param name="QOSCTRL_F_RESETVALUE" value="2"/>
              <param name="QOSCTRL_WRB_RESETVALUE" value="2"/>
              <param name="TRIG_BITS" value="6"/>
              <param name="TRIG_NUM" value="62"/>
              <param name="INSTANCE_ID" value="35"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="U2209" version="2.6.0">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="33"/>
            </parameters>
          </instance>
        </module>
