Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20n/atdf/ATSAMC20N17A.atdf
        <module name="EIC" id="U2254" version="3.0.0">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40002800"/>
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PA16"/>
              <signal group="EXTINT" index="0" function="A" pad="PB00"/>
              <signal group="EXTINT" index="0" function="A" pad="PB16"/>
              <signal group="EXTINT" index="0" function="A" pad="PC08"/>
              <signal group="EXTINT" index="0" function="A" pad="PC24"/>
              <signal group="EXTINT" index="0" function="A" pad="PA00"/>
              <signal group="EXTINT" index="1" function="A" pad="PA17"/>
              <signal group="EXTINT" index="1" function="A" pad="PB01"/>
              <signal group="EXTINT" index="1" function="A" pad="PB17"/>
              <signal group="EXTINT" index="1" function="A" pad="PC09"/>
              <signal group="EXTINT" index="1" function="A" pad="PC25"/>
              <signal group="EXTINT" index="1" function="A" pad="PA01"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PA18"/>
              <signal group="EXTINT" index="2" function="A" pad="PB02"/>
              <signal group="EXTINT" index="2" function="A" pad="PB18"/>
              <signal group="EXTINT" index="2" function="A" pad="PC10"/>
              <signal group="EXTINT" index="2" function="A" pad="PC26"/>
              <signal group="EXTINT" index="3" function="A" pad="PA03"/>
              <signal group="EXTINT" index="3" function="A" pad="PA19"/>
              <signal group="EXTINT" index="3" function="A" pad="PB03"/>
              <signal group="EXTINT" index="3" function="A" pad="PB19"/>
              <signal group="EXTINT" index="3" function="A" pad="PC11"/>
              <signal group="EXTINT" index="3" function="A" pad="PC27"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PA20"/>
              <signal group="EXTINT" index="4" function="A" pad="PB04"/>
              <signal group="EXTINT" index="4" function="A" pad="PB20"/>
              <signal group="EXTINT" index="4" function="A" pad="PC12"/>
              <signal group="EXTINT" index="4" function="A" pad="PC28"/>
              <signal group="EXTINT" index="5" function="A" pad="PA05"/>
              <signal group="EXTINT" index="5" function="A" pad="PA21"/>
              <signal group="EXTINT" index="5" function="A" pad="PB05"/>
              <signal group="EXTINT" index="5" function="A" pad="PB21"/>
              <signal group="EXTINT" index="5" function="A" pad="PC13"/>
              <signal group="EXTINT" index="6" function="A" pad="PA06"/>
              <signal group="EXTINT" index="6" function="A" pad="PA22"/>
              <signal group="EXTINT" index="6" function="A" pad="PB06"/>
              <signal group="EXTINT" index="6" function="A" pad="PB22"/>
              <signal group="EXTINT" index="6" function="A" pad="PC14"/>
              <signal group="EXTINT" index="7" function="A" pad="PA07"/>
              <signal group="EXTINT" index="7" function="A" pad="PA23"/>
              <signal group="EXTINT" index="7" function="A" pad="PB07"/>
              <signal group="EXTINT" index="7" function="A" pad="PB23"/>
              <signal group="EXTINT" index="7" function="A" pad="PC15"/>
              <signal group="EXTINT" index="8" function="A" pad="PB08"/>
              <signal group="EXTINT" index="8" function="A" pad="PB24"/>
              <signal group="EXTINT" index="8" function="A" pad="PC00"/>
              <signal group="EXTINT" index="8" function="A" pad="PC16"/>
              <signal group="EXTINT" index="8" function="A" pad="PA28"/>
              <signal group="EXTINT" index="9" function="A" pad="PA09"/>
              <signal group="EXTINT" index="9" function="A" pad="PB09"/>
              <signal group="EXTINT" index="9" function="A" pad="PB25"/>
              <signal group="EXTINT" index="9" function="A" pad="PC01"/>
              <signal group="EXTINT" index="9" function="A" pad="PC17"/>
              <signal group="EXTINT" index="10" function="A" pad="PA10"/>
              <signal group="EXTINT" index="10" function="A" pad="PA30"/>
              <signal group="EXTINT" index="10" function="A" pad="PB10"/>
              <signal group="EXTINT" index="10" function="A" pad="PC02"/>
              <signal group="EXTINT" index="10" function="A" pad="PC18"/>
              <signal group="EXTINT" index="11" function="A" pad="PA11"/>
              <signal group="EXTINT" index="11" function="A" pad="PA31"/>
              <signal group="EXTINT" index="11" function="A" pad="PB11"/>
              <signal group="EXTINT" index="11" function="A" pad="PC03"/>
              <signal group="EXTINT" index="11" function="A" pad="PC19"/>
              <signal group="EXTINT" index="12" function="A" pad="PA12"/>
              <signal group="EXTINT" index="12" function="A" pad="PA24"/>
              <signal group="EXTINT" index="12" function="A" pad="PB12"/>
              <signal group="EXTINT" index="12" function="A" pad="PC20"/>
              <signal group="EXTINT" index="13" function="A" pad="PA13"/>
              <signal group="EXTINT" index="13" function="A" pad="PA25"/>
              <signal group="EXTINT" index="13" function="A" pad="PB13"/>
              <signal group="EXTINT" index="13" function="A" pad="PC05"/>
              <signal group="EXTINT" index="13" function="A" pad="PC21"/>
              <signal group="EXTINT" index="14" function="A" pad="PB14"/>
              <signal group="EXTINT" index="14" function="A" pad="PB30"/>
              <signal group="EXTINT" index="14" function="A" pad="PC06"/>
              <signal group="EXTINT" index="14" function="A" pad="PA14"/>
              <signal group="EXTINT" index="15" function="A" pad="PA27"/>
              <signal group="EXTINT" index="15" function="A" pad="PB15"/>
              <signal group="EXTINT" index="15" function="A" pad="PB31"/>
              <signal group="EXTINT" index="15" function="A" pad="PC07"/>
              <signal group="EXTINT" index="15" function="A" pad="PA15"/>
              <signal group="NMI" function="A" pad="PA08"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="16"/>
              <param name="GCLK_ID" value="2"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="2"/>
              <param name="NUMBER_OF_DPRESCALER_REGS" value="2"/>
              <param name="NUMBER_OF_INTERRUPTS" value="16"/>
              <param name="INSTANCE_ID" value="10"/>
            </parameters>
          </instance>
        </module>
        <module name="EVSYS" id="U2256" version="1.1.0">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x42000000"/>
            <parameters>
              <param name="CHANNELS" value="12"/>
              <param name="CHANNELS_BITS" value="4"/>
              <param name="CHANNELS_MSB" value="11"/>
              <param name="EXTEVT_NUM" value="0"/>
              <param name="GENERATORS" value="96"/>
              <param name="GENERATORS_BITS" value="7"/>
              <param name="USERS" value="50"/>
              <param name="USERS_BITS" value="6"/>
              <param name="INSTANCE_ID" value="64"/>
            </parameters>
          </instance>
        </module>
        <module name="FREQM" id="U2257" version="2.0.0">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x40002C00"/>
            <parameters>
              <param name="GCLK_ID_MSR" value="3"/>
              <param name="INSTANCE_ID" value="11"/>
            </parameters>
          </instance>
        </module>
        <module name="GCLK" id="U2122" version="1.1.1">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x40001C00"/>
            <signals>
              <signal group="IO" index="0" function="H" pad="PB14"/>
              <signal group="IO" index="0" function="H" pad="PB22"/>
              <signal group="IO" index="0" function="H" pad="PA14"/>
              <signal group="IO" index="0" function="H" pad="PA27"/>
              <signal group="IO" index="0" function="H" pad="PA28"/>
              <signal group="IO" index="0" function="H" pad="PA30"/>
              <signal group="IO" index="1" function="H" pad="PB23"/>
              <signal group="IO" index="1" function="H" pad="PA15"/>
              <signal group="IO" index="1" function="H" pad="PB15"/>
              <signal group="IO" index="2" function="H" pad="PB16"/>
              <signal group="IO" index="2" function="H" pad="PA16"/>
              <signal group="IO" index="3" function="H" pad="PA17"/>
              <signal group="IO" index="3" function="H" pad="PB17"/>
              <signal group="IO" index="4" function="H" pad="PA10"/>
              <signal group="IO" index="4" function="H" pad="PB10"/>
              <signal group="IO" index="4" function="H" pad="PB18"/>
              <signal group="IO" index="4" function="H" pad="PA20"/>
              <signal group="IO" index="5" function="H" pad="PA11"/>
              <signal group="IO" index="5" function="H" pad="PA21"/>
              <signal group="IO" index="5" function="H" pad="PB11"/>
              <signal group="IO" index="5" function="H" pad="PB19"/>
              <signal group="IO" index="6" function="H" pad="PA22"/>
              <signal group="IO" index="6" function="H" pad="PB12"/>
              <signal group="IO" index="6" function="H" pad="PB20"/>
              <signal group="IO" index="7" function="H" pad="PB13"/>
              <signal group="IO" index="7" function="H" pad="PA23"/>
              <signal group="IO" index="7" function="H" pad="PB21"/>
            </signals>
            <parameters>
              <param name="GENDIV_BITS" value="16"/>
              <param name="GEN_BITS" value="4"/>
              <param name="GEN_NUM" value="9"/>
              <param name="GEN_NUM_MSB" value="8"/>
              <param name="GEN_SOURCE_NUM_MSB" value="7"/>
              <param name="NUM" value="46"/>
              <param name="SOURCE_BITS" value="3"/>
              <param name="SOURCE_FDPLL" value="7"/>
              <param name="SOURCE_GCLKGEN1" value="2"/>
              <param name="SOURCE_GCLKIN" value="1"/>
              <param name="SOURCE_NUM" value="8"/>
              <param name="SOURCE_OSCULP32K" value="3"/>
              <param name="SOURCE_OSC32K" value="4"/>
              <param name="SOURCE_XOSC" value="0"/>
              <param name="SOURCE_XOSC32K" value="5"/>
              <param name="INSTANCE_ID" value="7"/>
            </parameters>
          </instance>
        </module>
