Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20n/atdf/ATSAMC20N17A.atdf
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x42002C00"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PC03"/>
              <signal group="WO" index="0" function="F" pad="PA20"/>
              <signal group="WO" index="0" function="F" pad="PA24"/>
              <signal group="WO" index="1" function="F" pad="PA25"/>
              <signal group="WO" index="1" function="F" pad="PA21"/>
              <signal group="WO" index="1" function="F" pad="PC05"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DITHERING" value="0"/>
              <param name="DMAC_ID_OVF" value="24"/>
              <param name="DTI" value="0"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="29"/>
              <param name="MASTER_SLAVE_MODE" value="0"/>
              <param name="OTMX" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="PG" value="0"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0"/>
              <param name="INSTANCE_ID" value="75"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2251" version="1.0.1">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="8"/>
            </parameters>
          </instance>
        </module>
      <module name="SystemControl">
          <instance name="SystemControl">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
          </instance>
        </module><module name="SysTick">
          <instance name="SysTick">
            <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
          </instance>
        </module><module name="NVIC">
          <instance name="NVIC">
            <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
          </instance>
        </module></peripherals>
      <interrupts>
        <interrupt name="NonMaskableInt_IRQn" index="-14" caption="Non Maskable Interrupt"/>
        <interrupt name="HardFault_IRQn" index="-13" caption="Cortex-M0+ Hard Fault Interrupt"/>
        <interrupt name="SVCall_IRQn" index="-5" caption="Cortex-M0+ SV Call Interrupt"/>
        <interrupt name="PendSV_IRQn" index="-2" caption="Cortex-M0+ Pend SV Interrupt"/>
        <interrupt name="SysTick_IRQn" index="-1" caption="Cortex-M0+ System Tick Interrupt"/>
        <interrupt name="MCLK_IRQn" index="0" module-instance="MCLK"/>
        <interrupt name="OSCCTRL_IRQn" index="0" module-instance="OSCCTRL"/>
        <interrupt name="OSC32KCTRL_IRQn" index="0" module-instance="OSC32KCTRL"/>
        <interrupt name="PAC_IRQn" index="0" module-instance="PAC"/>
        <interrupt name="PM_IRQn" index="0" module-instance="PM"/>
        <interrupt name="SUPC_IRQn" index="0" module-instance="SUPC"/>
        <interrupt name="TAL_IRQn" index="0" module-instance="TAL"/>
        <interrupt name="WDT_IRQn" index="1" module-instance="WDT"/>
        <interrupt name="RTC_IRQn" index="2" module-instance="RTC"/>
        <interrupt name="EIC_IRQn" index="3" module-instance="EIC"/>
        <interrupt name="FREQM_IRQn" index="4" module-instance="FREQM"/>
        <interrupt name="NVMCTRL_IRQn" index="6" module-instance="NVMCTRL"/>
        <interrupt name="DMAC_IRQn" index="7" module-instance="DMAC"/>
        <interrupt name="EVSYS_IRQn" index="8" module-instance="EVSYS"/>
        <interrupt name="SERCOM0_IRQn" index="9" module-instance="SERCOM0"/>
        <interrupt name="SERCOM6_IRQn" index="9" module-instance="SERCOM6"/>
        <interrupt name="SERCOM1_IRQn" index="10" module-instance="SERCOM1"/>
        <interrupt name="SERCOM7_IRQn" index="10" module-instance="SERCOM7"/>
        <interrupt name="SERCOM2_IRQn" index="11" module-instance="SERCOM2"/>
        <interrupt name="SERCOM3_IRQn" index="12" module-instance="SERCOM3"/>
        <interrupt name="SERCOM4_IRQn" index="13" module-instance="SERCOM4"/>
        <interrupt name="SERCOM5_IRQn" index="14" module-instance="SERCOM5"/>
        <interrupt name="TCC0_IRQn" index="17" module-instance="TCC0"/>
        <interrupt name="TCC1_IRQn" index="18" module-instance="TCC1"/>
        <interrupt name="TCC2_IRQn" index="19" module-instance="TCC2"/>
        <interrupt name="TC0_IRQn" index="20" module-instance="TC0"/>
        <interrupt name="TC5_IRQn" index="20" module-instance="TC5"/>
        <interrupt name="TC1_IRQn" index="21" module-instance="TC1"/>
        <interrupt name="TC6_IRQn" index="21" module-instance="TC6"/>
        <interrupt name="TC2_IRQn" index="22" module-instance="TC2"/>
        <interrupt name="TC7_IRQn" index="22" module-instance="TC7"/>
        <interrupt name="TC3_IRQn" index="23" module-instance="TC3"/>
        <interrupt name="TC4_IRQn" index="24" module-instance="TC4"/>
        <interrupt name="ADC0_IRQn" index="25" module-instance="ADC0"/>
        <interrupt name="AC_IRQn" index="27" module-instance="AC"/>
        <interrupt name="PTC_IRQn" index="30" module-instance="PTC"/>
      </interrupts>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x11001421"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2245" version="1.1.1" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
