Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20n/atdf/ATSAMC20N17A.atdf
        <register name="APBDMASK" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="APBD Mask">
          <bitfield name="SERCOM6_" caption="SERCOM6 APB Clock Enable" mask="0x1"/>
          <bitfield name="SERCOM7_" caption="SERCOM7 APB Clock Enable" mask="0x2"/>
          <bitfield name="TC5_" caption="TC5 APB Clock Enable" mask="0x4"/>
          <bitfield name="TC6_" caption="TC6 APB Clock Enable" mask="0x8"/>
          <bitfield name="TC7_" caption="TC7 APB Clock Enable" mask="0x10"/>
        </register>
      </register-group>
      <value-group name="MCLK_CPUDIV__CPUDIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
    </module>
    <module name="MTB" id="U2002" version="1.0.0" caption="Cortex-M0+ Micro-Trace Buffer">
      <register-group name="MTB" caption="Cortex-M0+ Micro-Trace Buffer">
        <register name="POSITION" offset="0x0" rw="RW" size="4" access-size="4" caption="MTB Position">
          <bitfield name="WRAP" caption="Pointer Value Wraps" mask="0x4"/>
          <bitfield name="POINTER" caption="Trace Packet Location Pointer" mask="0xFFFFFFF8"/>
        </register>
        <register name="MASTER" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="MTB Master">
          <bitfield name="MASK" caption="Maximum Value of the Trace Buffer in SRAM" mask="0x1F"/>
          <bitfield name="TSTARTEN" caption="Trace Start Input Enable" mask="0x20"/>
          <bitfield name="TSTOPEN" caption="Trace Stop Input Enable" mask="0x40"/>
          <bitfield name="SFRWPRIV" caption="Special Function Register Write Privilege" mask="0x80"/>
          <bitfield name="RAMPRIV" caption="SRAM Privilege" mask="0x100"/>
          <bitfield name="HALTREQ" caption="Halt Request" mask="0x200"/>
          <bitfield name="EN" caption="Main Trace Enable" mask="0x80000000"/>
        </register>
        <register name="FLOW" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="MTB Flow">
          <bitfield name="AUTOSTOP" caption="Auto Stop Tracing" mask="0x1"/>
          <bitfield name="AUTOHALT" caption="Auto Halt Request" mask="0x2"/>
          <bitfield name="WATERMARK" caption="Watermark value" mask="0xFFFFFFF8"/>
        </register>
        <register name="BASE" offset="0xC" rw="R" size="4" access-size="4" caption="MTB Base">
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" caption="MTB Integration Mode Control">
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="MTB Claim Set">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="MTB Claim Clear">
        </register>
        <register name="LOCKACCESS" offset="0xFB0" rw="RW" size="4" access-size="4" caption="MTB Lock Access">
        </register>
        <register name="LOCKSTATUS" offset="0xFB4" rw="R" size="4" access-size="4" caption="MTB Lock Status">
        </register>
        <register name="AUTHSTATUS" offset="0xFB8" rw="R" size="4" access-size="4" caption="MTB Authentication Status">
        </register>
        <register name="DEVARCH" offset="0xFBC" rw="R" size="4" access-size="4" caption="MTB Device Architecture">
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="MTB Device Configuration">
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="MTB Device Type">
        </register>
        <register name="PID4" offset="0xFD0" rw="R" size="4" access-size="4" caption="Peripheral Identification 4">
        </register>
        <register name="PID5" offset="0xFD4" rw="R" size="4" access-size="4" caption="Peripheral Identification 5">
        </register>
        <register name="PID6" offset="0xFD8" rw="R" size="4" access-size="4" caption="Peripheral Identification 6">
        </register>
        <register name="PID7" offset="0xFDC" rw="R" size="4" access-size="4" caption="Peripheral Identification 7">
        </register>
        <register name="PID0" offset="0xFE0" rw="R" size="4" access-size="4" caption="Peripheral Identification 0">
        </register>
        <register name="PID1" offset="0xFE4" rw="R" size="4" access-size="4" caption="Peripheral Identification 1">
        </register>
        <register name="PID2" offset="0xFE8" rw="R" size="4" access-size="4" caption="Peripheral Identification 2">
        </register>
        <register name="PID3" offset="0xFEC" rw="R" size="4" access-size="4" caption="Peripheral Identification 3">
        </register>
        <register name="CID0" offset="0xFF0" rw="R" size="4" access-size="4" caption="Component Identification 0">
        </register>
        <register name="CID1" offset="0xFF4" rw="R" size="4" access-size="4" caption="Component Identification 1">
        </register>
        <register name="CID2" offset="0xFF8" rw="R" size="4" access-size="4" caption="Component Identification 2">
        </register>
        <register name="CID3" offset="0xFFC" rw="R" size="4" access-size="4" caption="Component Identification 3">
        </register>
      </register-group>
    </module>
    <module name="NVMCTRL" id="U2207" version="4.0.2" caption="Non-Volatile Memory Controller">
      <register-group name="NVMCTRL" caption="Non-Volatile Memory Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="2" initval="0x0000" caption="Control A">
          <bitfield name="CMD" caption="Command" mask="0x7F" values="NVMCTRL_CTRLA__CMD"/>
          <bitfield name="CMDEX" caption="Command Execution" mask="0xFF00" values="NVMCTRL_CTRLA__CMDEX"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000080" caption="Control B">
          <bitfield name="RWS" caption="NVM Read Wait States" mask="0x1E" values="NVMCTRL_CTRLB__RWS"/>
          <bitfield name="MANW" caption="Manual Write" mask="0x80"/>
          <bitfield name="SLEEPPRM" caption="Power Reduction Mode during Sleep" mask="0x300" values="NVMCTRL_CTRLB__SLEEPPRM"/>
          <bitfield name="READMODE" caption="NVMCTRL Read Mode" mask="0x30000" values="NVMCTRL_CTRLB__READMODE"/>
          <bitfield name="CACHEDIS" caption="Cache Disable" mask="0xC0000"/>
        </register>
