Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20n/atdf/ATSAMC20N17A.atdf
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt enable clear">
          <bitfield name="ERR" caption="Peripheral access error interrupt disable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt enable set">
          <bitfield name="ERR" caption="Peripheral access error interrupt enable" mask="0x1"/>
        </register>
        <register name="INTFLAGAHB" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAGAHB" initval="0x00000000" caption="Bridge interrupt flag status">
          <bitfield name="FLASH_" caption="FLASH" mask="0x1"/>
          <bitfield name="HSRAMCM0P_" caption="HSRAMCM0P" mask="0x2"/>
          <bitfield name="HSRAMDSU_" caption="HSRAMDSU" mask="0x4"/>
          <bitfield name="HPB1_" caption="HPB1" mask="0x8"/>
          <bitfield name="HPB0_" caption="HPB0" mask="0x10"/>
          <bitfield name="HPB2_" caption="HPB2" mask="0x20"/>
          <bitfield name="LPRAMDMAC_" caption="LPRAMDMAC" mask="0x40"/>
          <bitfield name="DIVAS_" caption="DIVAS" mask="0x80"/>
          <bitfield name="HPB3_" caption="HPB3" mask="0x100"/>
        </register>
        <register name="INTFLAGA" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAGA" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge A">
          <bitfield name="PAC_" caption="PAC" mask="0x1"/>
          <bitfield name="PM_" caption="PM" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM" mask="0x800"/>
        </register>
        <register name="INTFLAGB" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAGB" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge B">
          <bitfield name="PORT_" caption="PORT" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC" mask="0x8"/>
          <bitfield name="MTB_" caption="MTB" mask="0x10"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS" mask="0x20"/>
        </register>
        <register name="INTFLAGC" offset="0x1C" rw="RW" size="4" atomic-op="clear:INTFLAGC" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge C">
          <bitfield name="EVSYS_" caption="EVSYS" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1" mask="0x4"/>
          <bitfield name="SERCOM2_" caption="SERCOM2" mask="0x8"/>
          <bitfield name="SERCOM3_" caption="SERCOM3" mask="0x10"/>
          <bitfield name="SERCOM4_" caption="SERCOM4" mask="0x20"/>
          <bitfield name="SERCOM5_" caption="SERCOM5" mask="0x40"/>
          <bitfield name="TCC0_" caption="TCC0" mask="0x200"/>
          <bitfield name="TCC1_" caption="TCC1" mask="0x400"/>
          <bitfield name="TCC2_" caption="TCC2" mask="0x800"/>
          <bitfield name="TC0_" caption="TC0" mask="0x1000"/>
          <bitfield name="TC1_" caption="TC1" mask="0x2000"/>
          <bitfield name="TC2_" caption="TC2" mask="0x4000"/>
          <bitfield name="TC3_" caption="TC3" mask="0x8000"/>
          <bitfield name="TC4_" caption="TC4" mask="0x10000"/>
          <bitfield name="ADC0_" caption="ADC0" mask="0x20000"/>
          <bitfield name="AC_" caption="AC" mask="0x100000"/>
          <bitfield name="PTC_" caption="PTC" mask="0x400000"/>
          <bitfield name="CCL_" caption="CCL" mask="0x800000"/>
          <bitfield name="TAL_" caption="TAL" mask="0x1000000"/>
        </register>
        <register name="INTFLAGD" offset="0x20" rw="RW" size="4" atomic-op="clear:INTFLAGD" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge D">
          <bitfield name="SERCOM6_" caption="SERCOM6" mask="0x1"/>
          <bitfield name="SERCOM7_" caption="SERCOM7" mask="0x2"/>
          <bitfield name="TC5_" caption="TC5" mask="0x4"/>
          <bitfield name="TC6_" caption="TC6" mask="0x8"/>
          <bitfield name="TC7_" caption="TC7" mask="0x10"/>
        </register>
        <register name="STATUSA" offset="0x34" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge A">
          <bitfield name="PAC_" caption="PAC APB Protect Enable" mask="0x1"/>
          <bitfield name="PM_" caption="PM APB Protect Enable" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK APB Protect Enable" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC APB Protect Enable" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Protect Enable" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Protect Enable" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC APB Protect Enable" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK APB Protect Enable" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT APB Protect Enable" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC APB Protect Enable" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC APB Protect Enable" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM APB Protect Enable" mask="0x800"/>
        </register>
        <register name="STATUSB" offset="0x38" rw="R" size="4" initval="0x00000002" caption="Peripheral write protection status - Bridge B">
          <bitfield name="PORT_" caption="PORT APB Protect Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Protect Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Protect Enable" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC APB Protect Enable" mask="0x8"/>
          <bitfield name="MTB_" caption="MTB APB Protect Enable" mask="0x10"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS APB Protect Enable" mask="0x20"/>
        </register>
