Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20n/atdf/ATSAMC20N17A.atdf
        <register name="EVCPUSEL0" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="EVSYS Channel Interrupts CPU Select 0">
          <bitfield name="CH0" caption="Event Channel 0 Interrupt CPU Select" mask="0x1"/>
          <bitfield name="CH1" caption="Event Channel 1 Interrupt CPU Select" mask="0x4"/>
          <bitfield name="CH2" caption="Event Channel 2 Interrupt CPU Select" mask="0x10"/>
          <bitfield name="CH3" caption="Event Channel 3 Interrupt CPU Select" mask="0x40"/>
          <bitfield name="CH4" caption="Event Channel 4 Interrupt CPU Select" mask="0x100"/>
          <bitfield name="CH5" caption="Event Channel 5 Interrupt CPU Select" mask="0x400"/>
          <bitfield name="CH6" caption="Event Channel 6 Interrupt CPU Select" mask="0x1000"/>
          <bitfield name="CH7" caption="Event Channel 7 Interrupt CPU Select" mask="0x4000"/>
          <bitfield name="CH8" caption="Event Channel 8 Interrupt CPU Select" mask="0x10000"/>
          <bitfield name="CH9" caption="Event Channel 9 Interrupt CPU Select" mask="0x40000"/>
          <bitfield name="CH10" caption="Event Channel 10 Interrupt CPU Select" mask="0x100000"/>
          <bitfield name="CH11" caption="Event Channel 11 Interrupt CPU Select" mask="0x400000"/>
        </register>
        <register name="EICCPUSEL0" offset="0x50" rw="RW" size="4" initval="0x00000000" caption="EIC External Interrupts CPU Select 0">
          <bitfield name="EXTINT0" caption="External Interrupt 0 CPU Select" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt 1 CPU Select" mask="0x4"/>
          <bitfield name="EXTINT2" caption="External Interrupt 2 CPU Select" mask="0x10"/>
          <bitfield name="EXTINT3" caption="External Interrupt 3 CPU Select" mask="0x40"/>
          <bitfield name="EXTINT4" caption="External Interrupt 4 CPU Select" mask="0x100"/>
          <bitfield name="EXTINT5" caption="External Interrupt 5 CPU Select" mask="0x400"/>
          <bitfield name="EXTINT6" caption="External Interrupt 6 CPU Select" mask="0x1000"/>
          <bitfield name="EXTINT7" caption="External Interrupt 7 CPU Select" mask="0x4000"/>
          <bitfield name="EXTINT8" caption="External Interrupt 8 CPU Select" mask="0x10000"/>
          <bitfield name="EXTINT9" caption="External Interrupt 9 CPU Select" mask="0x40000"/>
          <bitfield name="EXTINT10" caption="External Interrupt 10 CPU Select" mask="0x100000"/>
          <bitfield name="EXTINT11" caption="External Interrupt 11 CPU Select" mask="0x400000"/>
          <bitfield name="EXTINT12" caption="External Interrupt 12 CPU Select" mask="0x1000000"/>
          <bitfield name="EXTINT13" caption="External Interrupt 13 CPU Select" mask="0x4000000"/>
          <bitfield name="EXTINT14" caption="External Interrupt 14 CPU Select" mask="0x10000000"/>
          <bitfield name="EXTINT15" caption="External Interrupt 15 CPU Select" mask="0x40000000"/>
        </register>
        <register name="INTCPUSEL0" offset="0x58" rw="RW" size="4" initval="0x00000000" caption="Interrupts CPU Select 0">
        </register>
        <register name="INTCPUSEL1" offset="0x5C" rw="RW" size="4" initval="0x00000000" caption="Interrupts CPU Select 1">
        </register>
        <register name="IRQTRIG" offset="0x60" rw="RW" size="2" initval="0x0000" caption="Interrupt Trigger">
          <bitfield name="ENABLE" caption="Trigger Enable" mask="0x1"/>
          <bitfield name="IRQNUM" caption="Interrupt Request Number" mask="0x3E"/>
          <bitfield name="OVERRIDE" caption="Interrupt Request Override Value" mask="0xFF00"/>
        </register>
      </register-group>
      <value-group name="TAL_BRKSTATUS__CM0P">
        <value name="INT_RUN" caption="CM0P running, by internal request" value="0x0"/>
        <value name="INT_HALT" caption="CM0P halted, by internal request" value="0x1"/>
        <value name="EXT_RUN" caption="CM0P running, by external request" value="0x2"/>
        <value name="EXT_HALT" caption="CM0P halted, by external request" value="0x3"/>
      </value-group>
      <value-group name="TAL_BRKSTATUS__EVBRK">
        <value name="INT_RUN" caption="EVBRK running" value="0x0"/>
      </value-group>
      <value-group name="TAL_BRKSTATUS__EXTBRK">
        <value name="INT_RUN" caption="External CPU running, by internal request" value="0x0"/>
        <value name="INT_HALT" caption="External CPU halted, by internal request" value="0x1"/>
        <value name="EXT_RUN" caption="External CPU running, by external request" value="0x2"/>
        <value name="EXT_HALT" caption="External CPU halted, by external request" value="0x3"/>
      </value-group>
      <value-group name="TAL_BRKSTATUS__PPP">
        <value name="INT_RUN" caption="PPP running, by internal request" value="0x0"/>
        <value name="INT_HALT" caption="PPP halted, by internal request" value="0x1"/>
        <value name="EXT_RUN" caption="PPP running, by external request" value="0x2"/>
        <value name="EXT_HALT" caption="PPP halted, by external request" value="0x3"/>
      </value-group>
      <value-group name="TAL_CTICTRLA__ACTION">
        <value name="BREAK" caption="Break when requested" value="0"/>
        <value name="INTERRUPT" caption="Trigger DBG interrupt instead of break" value="1"/>
        <value name="IGNORE" caption="Ignore break request" value="2"/>
      </value-group>
    </module>
    <module name="TC" id="U2249" version="3.0.0" caption="Basic Timer Counter">
      <register-group class="union" union-tag="TC.CTRLA.MODE" name="TC" caption="Basic Timer Counter">
        <register-group name="COUNT8" name-in-module="TC_COUNT8" union-tag-value="1" offset="0"/>
        <register-group name="COUNT16" name-in-module="TC_COUNT16" union-tag-value="0" offset="0"/>
        <register-group name="COUNT32" name-in-module="TC_COUNT32" union-tag-value="2" offset="0"/>
      </register-group>
      <register-group name="TC_COUNT8" caption="Basic Timer Counter - 8-bit Counter Mode">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Timer Counter Mode" mask="0xC" values="TC_CTRLA__MODE"/>
          <bitfield name="PRESCSYNC" caption="Prescaler and Counter Synchronization" mask="0x30" values="TC_CTRLA__PRESCSYNC"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="Clock On Demand" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0x700" values="TC_CTRLA__PRESCALER"/>
          <bitfield name="ALOCK" caption="Auto Lock" mask="0x800"/>
          <bitfield name="CAPTEN0" caption="Capture Channel 0 Enable" mask="0x10000"/>
          <bitfield name="CAPTEN1" caption="Capture Channel 1 Enable" mask="0x20000"/>
          <bitfield name="COPEN0" caption="Capture On Pin 0 Enable" mask="0x100000"/>
          <bitfield name="COPEN1" caption="Capture On Pin 1 Enable" mask="0x200000"/>
          <bitfield name="CAPTMODE0" caption="Capture Mode Channel 0" mask="0x3000000" values="TC_CTRLA__CAPTMODE0"/>
          <bitfield name="CAPTMODE1" caption="Capture mode Channel 1" mask="0x18000000" values="TC_CTRLA__CAPTMODE1"/>
        </register>
        <register name="CTRLBCLR" offset="0x4" rw="RW" access="RWSYNC" size="1" atomic-op="clear:CTRLBCLR" initval="0x00" caption="Control B Clear">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="ONESHOT" caption="One-Shot on Counter" mask="0x4"/>
          <bitfield name="CMD" caption="Command" mask="0xE0" values="TC_CTRLBCLR__CMD"/>
        </register>
        <register name="CTRLBSET" offset="0x5" rw="RW" access="RWSYNC" size="1" atomic-op="set:CTRLBSET" initval="0x00" caption="Control B Set">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="ONESHOT" caption="One-Shot on Counter" mask="0x4"/>
          <bitfield name="CMD" caption="Command" mask="0xE0" values="TC_CTRLBSET__CMD"/>
        </register>
